Mirrored Property
 Property to test whether the family instance is mirrored. (only one axis is flipped)
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public bool Mirrored { get; }
  Visual Basic
Public ReadOnly Property Mirrored As Boolean
	Get
  Visual C++
public:
property bool Mirrored {
	bool get ();
}
 See Also
  FamilyInstance Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →